#pragma once
//=====================================================================
//								Blood.h
//						 血飛沫エフェクトクラス
//=====================================================================


//　定数---------------------------------------------------------------
const VECTOR2 BLOOD_DIV_CNT  = {   5,   3 };	//分割数
const VECTOR2 BLOOD_DIV_SIZE = { 256, 256 };	//分割サイズ

class Blood : public Effect
{
private:
	//　アニメーション-----------------------------------------------------
	int _animIdx;			//アニメーションのカウント
	int _animBlood;			//塵アニメの速度

public:
	Blood();	//コンストラクタ
	~Blood();	//　デストラクタ

	//　通常のメソッド-----------------------------------------------------
	void Initialize();				//初期化
	void Initialize( VECTOR2 pos );	//初期化
	void Finalize();	//終了処理
	void Update();		//更新
	void Draw();		//描画
};