#pragma once
//=====================================================================
//								Fall.h
//						 血飛沫エフェクトクラス
//=====================================================================


//　定数---------------------------------------------------------------
const Vector2 FALL_DIV_CNT  = {   5,   3 };	//分割数
const Vector2 FALL_DIV_SIZE = { 224, 288 };	//分割サイズ

class Fall : public Effect
{
private:
	//　アニメーション-----------------------------------------------------
	int _animIdx;			//アニメーションのカウント
	int _animFall;			//塵アニメの速度

public:
	Fall();	//コンストラクタ
	~Fall();	//　デストラクタ

	//　通常のメソッド-----------------------------------------------------
	void Initialize();				//初期化
	void Initialize( Vector2 pos );	//初期化
	void Finalize();	//終了処理
	void Update();		//更新
	void Draw(const Vector2& offset_);		//描画
};